In [ ]:
!gdown --id 1BSHIKQ7rFw5BpTq5nw1UZfjPK_7Mpnbi
!mv _sqlite3.cpython-37m-x86_64-linux-gnu.so /usr/lib/python3.7/lib-dynload/
import os
os.kill(os.getpid(), 9)

Downloading...
From: https://drive.google.com/uc?id=1BSHIKQ7rFw5BpTq5nw1UZfjPK_7Mpnbi
To: /content/_sqlite3.cpython-37m-x86_64-linux-gnu.so
6.23MB [00:00, 54.6MB/s]

In [ ]:
import sqlite3
import pandas as pd
import numpy as np

In [ ]:
con = sqlite3.connect('db')

# Новый раздел

# Новый раздел

In [ ]:
!gdown --id 1Gj0qVU0Acv-HqRjTIEwvkO4TqJYijehR

Downloading...
From: https://drive.google.com/uc?id=1Gj0qVU0Acv-HqRjTIEwvkO4TqJYijehR
To: /content/german_credit_augmented.csv
100% 69.6k/69.6k [00:00<00:00, 60.8MB/s]

In [ ]:
df = pd.read_csv('/content/german_credit_augmented.csv')

In [ ]:
df.head()

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [ ]:
df['contract_dt'] = pd.to_datetime(df['contract_dt'],format='%Y-%m-%d %H:%M:%S')

In [ ]:
df.dtypes

age                          int64
sex                         object
job                          int64
housing                     object
saving_accounts             object
checking_account            object
credit_amount                int64
duration                     int64
purpose                     object
default                      int64
contract_dt         datetime64[ns]
client_id                    int64
dtype: object

In [ ]:
df.to_sql('german_credit',con,index=False,if_exists='replace')

In [ ]:
def select(sql):
  return pd.read_sql(sql, con)

In [ ]:
sql = '''select t.* from german_credit t limit 5'''

In [ ]:
t = select(sql)

In [ ]:
t.head()

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

Игрушечные данные

In [ ]:
df_01 = pd.DataFrame({'user_id':[1,2,3]})

In [ ]:
df_01.to_sql('users', con, index=False, if_exists='replace')

In [ ]:
sql1 = ''' select 
* from users t'''

In [ ]:
pd.read_sql(sql1,con)

   user_id
0        1
1        2
2        3

In [ ]:
t.head()

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [ ]:
sql = '''select t.age as age_mult_3 from german_credit as t'''

In [ ]:
select(sql)

     age_mult_3
0            33
1            43
2            52
3            35
4            28
..          ...
995          65
996          30
997          33
998          29
999          44

[1000 rows x 1 columns]

In [ ]:
sql = ''' select t.age * 3 from german_credit t'''

In [ ]:
select (sql)

     t.age * 3
0           99
1          129
2          156
3          105
4           84
..         ...
995        195
996         90
997         99
998         87
999        132

[1000 rows x 1 columns]

In [ ]:
sql = '''SELECT t.age * 3 AS multi_age FROM german_credit AS t'''

In [ ]:
pd.read_sql(sql, sqlite3.connect('db'))

     multi_age
0           99
1          129
2          156
3          105
4           84
..         ...
995        195
996         90
997         99
998         87
999        132

[1000 rows x 1 columns]

In [ ]:
sql = '''SELECT t.age / credit_amount * 1.0 AS summ, t.age FROM german_credit AS t'''

In [ ]:
select(sql)

     summ  age
0     0.0   33
1     0.0   43
2     0.0   52
3     0.0   35
4     0.0   28
..    ...  ...
995   0.0   65
996   0.0   30
997   0.0   33
998   0.0   29
999   0.0   44

[1000 rows x 2 columns]

In [ ]:
sql = ''' SELECT * FROM german_credit AS t LIMIT 10'''

In [ ]:
select(sql)

   age     sex  job  ... default          contract_dt client_id
0   33    male    2  ...       0  2008-06-29 18:52:00       210
1   43    male    1  ...       0  2007-05-20 18:30:19       929
2   52    male    2  ...       0  2008-04-27 08:23:07       200
3   35  female    3  ...       0  2007-05-06 10:58:22        45
4   28    male    2  ...       0  2007-07-21 13:22:14       358
5   27  female    2  ...       0  2008-06-18 04:10:05        86
6   29  female    2  ...       1  2007-05-21 14:32:00       351
7   42  female    2  ...       0  2008-06-05 05:31:13        27
8   26    male    2  ...       1  2007-11-29 00:20:44       639
9   55    male    2  ...       1  2007-09-11 20:27:28       754

[10 rows x 12 columns]

In [ ]:
sql = ''' SELECT * FROM german_credit AS t 
WHERE t.contract_dt BETWEEN '2007-01-01' AND '2007-12-31'
AND t.purpose IN ('car', 'repairs')
ORDER BY t.contract_dt desc
'''

In [ ]:
select(sql)

     age     sex  job housing  ...  purpose default          contract_dt  client_id
0     36    male    3    rent  ...      car       0  2007-12-29 16:10:08         99
1     30    male    2     own  ...  repairs       1  2007-12-28 17:09:43        127
2     25    male    2    rent  ...      car       1  2007-12-28 08:38:58        979
3     48    male    2     own  ...      car       0  2007-12-24 16:28:30         20
4     67  female    2     own  ...  repairs       0  2007-12-24 12:25:28        779
..   ...     ...  ...     ...  ...      ...     ...                  ...        ...
192   55    male    2     own  ...      car       0  2007-05-05 06:35:11        209
193   55  female    0    free  ...  repairs       1  2007-05-05 00:14:17        429
194   47    male    3     own  ...      car       1  2007-05-03 10:29:01        485
195   36    male    2     own  ...      car       1  2007-05-02 06:22:11        184
196   31    male    2     own  ...      car       1  2007-05-01 23:14:02        598

[197 rows x 12 columns]

In [ ]:
sql = '''SELECT * FROM german_credit AS t 
WHERE t.contract_dt BETWEEN '2007-01-01' AND '2007-12-31'
ORDER BY t.contract_dt DESC LIMIT 5'''

In [ ]:
select(sql)

   age     sex  job  ... default          contract_dt client_id
0   31  female    1  ...       0  2007-12-30 13:29:15       995
1   35    male    1  ...       0  2007-12-30 00:40:33       256
2   23  female    2  ...       1  2007-12-29 20:14:30       359
3   36    male    3  ...       0  2007-12-29 16:10:08        99
4   30    male    2  ...       1  2007-12-28 17:09:43       127

[5 rows x 12 columns]

In [ ]:
df1 = pd.DataFrame({'purpose':['машина', 'на машину','автомобиль','на возврат'], 'amount':[1000,2000,3000,5000]})

In [ ]:
df1.to_sql('purpose', con, index=False, if_exists='replace')

In [ ]:
sql = ''' select * from purpose as p'''

In [ ]:
select(sql)

      purpose  amount
0      машина    1000
1   на машину    2000
2  автомобиль    3000
3  на возврат    5000

In [ ]:
sql = ''' select * from purpose as p
where (p.purpose like '%машин%'
or p.purpose like '%авто%')
'''

In [ ]:
select(sql)

      purpose  amount
0      машина    1000
1   на машину    2000
2  автомобиль    3000

In [ ]:
sql = '''select count(*)from german_credit t'''

In [ ]:
select(sql)

   count(*)
0      1000

In [ ]:
sql = '''select count(*)from german_credit t
where t.credit_amount > 1000'''

In [ ]:
select(sql)

   count(*)
0       884

In [ ]:
884/1000

0.884

In [ ]:
sql = '''select t.credit_amount, 
case when t.credit_amount > 1000 then 1 else 0 end as greater_1000_flag,
iif(t.credit_amount > 1000,1,0) as greater_flag_2
from german_credit t'''

In [ ]:
select(sql)

     credit_amount  greater_1000_flag  greater_flag_2
0             3074                  1               1
1             1344                  1               1
2              936                  0               0
3             1393                  1               1
4              776                  0               0
..             ...                ...             ...
995           2600                  1               1
996           4455                  1               1
997           6403                  1               1
998           5003                  1               1
999           1804                  1               1

[1000 rows x 3 columns]

In [ ]:
sql = '''select 
avg(case when t.credit_amount > 1000 then 1 else 0 end) as gr_fraction
from german_credit t'''

In [ ]:
select(sql)

   gr_fraction
0        0.884

In [ ]:
sql ='''select * from german_credit t
where t.credit_amount > 1000'''

In [ ]:
select(sql)

     age     sex  job  ... default          contract_dt client_id
0     33    male    2  ...       0  2008-06-29 18:52:00       210
1     43    male    1  ...       0  2007-05-20 18:30:19       929
2     35  female    3  ...       0  2007-05-06 10:58:22        45
3     27  female    2  ...       0  2008-06-18 04:10:05        86
4     26    male    2  ...       1  2007-11-29 00:20:44       639
..   ...     ...  ...  ...     ...                  ...       ...
879   65    male    2  ...       1  2007-12-16 20:17:19       624
880   30    male    3  ...       1  2007-07-12 14:08:58       181
881   33    male    2  ...       0  2008-04-08 03:24:26       730
882   29  female    2  ...       1  2007-11-29 15:51:45       557
883   44    male    2  ...       0  2007-08-14 09:05:33        23

[884 rows x 12 columns]

In [ ]:
cur = con.cursor()

In [ ]:
sql ='''
drop table if exists greater_1000_credit;
create table greater_1000_credit as 
select * from german_credit t
where t.credit_amount > 1000'''

In [ ]:
cur.executescript(sql)

In [ ]:
sql = '''select * from greater_1000_credit as t'''

In [ ]:
select(sql)

     age     sex  job  ... default          contract_dt client_id
0     33    male    2  ...       0  2008-06-29 18:52:00       210
1     43    male    1  ...       0  2007-05-20 18:30:19       929
2     35  female    3  ...       0  2007-05-06 10:58:22        45
3     27  female    2  ...       0  2008-06-18 04:10:05        86
4     26    male    2  ...       1  2007-11-29 00:20:44       639
..   ...     ...  ...  ...     ...                  ...       ...
879   65    male    2  ...       1  2007-12-16 20:17:19       624
880   30    male    3  ...       1  2007-07-12 14:08:58       181
881   33    male    2  ...       0  2008-04-08 03:24:26       730
882   29  female    2  ...       1  2007-11-29 15:51:45       557
883   44    male    2  ...       0  2007-08-14 09:05:33        23

[884 rows x 12 columns]

In [ ]:
from sqlalchemy import create_engine
con_pg = create_engine('postgresql+psycopg2://artoxeig:IeNTfTHOt3TKuBgRXNrXO6IybHwuShdF@hattie.db.elephantsql.com:5432/artoxeig')

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [ ]:
def select_pg(sql):
  return pd.read_sql(sql,con_pg)

UNION ALL

In [ ]:
jan = pd.DataFrame({'month':['jan','jan'],'revenue':[1,2]})
feb = pd.DataFrame({'month':['feb','feb'],'revenue':[1,2]})

In [ ]:
jan.to_sql('jan', con, index=False, if_exists='replace')
feb.to_sql('feb', con, index=False, if_exists='replace')

In [ ]:
sql = '''select * from jan t
union all
select * from feb f'''

In [ ]:
select(sql)

  month  revenue
0   jan        1
1   jan        2
2   feb        1
3   feb        2

In [ ]:
sql = '''select t.revenue,
'jan' as month
 from jan t
union all
select t.revenue,
'mar' as month
 from feb t'''

In [ ]:
select(sql)

   revenue month
0        1   jan
1        2   jan
2        1   mar
3        2   mar

In [ ]:
sql ='''select t.sex, substr(t.sex,1,1) from german_credit t'''

In [ ]:
select(sql)

        sex substr(t.sex,1,1)
0      male                 m
1      male                 m
2      male                 m
3    female                 f
4      male                 m
..      ...               ...
995    male                 m
996    male                 m
997    male                 m
998  female                 f
999    male                 m

[1000 rows x 2 columns]

In [ ]:
sql = '''select t.sex,
substring(t.sex,1,1),

left(t.sex,3)

 from german_credit t'''

In [ ]:
select_pg(sql)

        sex substring left
0      male         m  mal
1      male         m  mal
2      male         m  mal
3    female         f  fem
4      male         m  mal
..      ...       ...  ...
995    male         m  mal
996    male         m  mal
997    male         m  mal
998  female         f  fem
999    male         m  mal

[1000 rows x 3 columns]

GROUP BY

In [ ]:
sql = '''select t.housing,
count(1) as cnt,
avg(t.credit_amount) as credit_amount_avg
from german_credit t
group by t.housing'''

In [ ]:
select(sql)

  housing  cnt  credit_amount_avg
0    free  108        4906.212963
1     own  713        3060.939691
2    rent  179        3122.553073

In [ ]:
df.groupby('sex')['credit_amount'].agg(['count','mean'])

        count         mean
sex
female    310  2877.774194
male      690  3448.040580

In [ ]:
sql ='''select 
count(distinct t.housing) 
from german_credit t'''

In [ ]:
select(sql)

   count(distinct t.housing)
0                          3

In [ ]:
sql = ''' Create table If Not Exists World (name varchar(255), continent varchar(255), area int, population int, gdp int)
INSERT INTO World (name, continent, area, population, gdp) values ('Afghanistan', 'Asia', '652230', '25500100', '20343000000')
insert into World (name, continent, area, population, gdp) values ('Albania', 'Europe', '28748', '2831741', '12960000000')
insert into World (name, continent, area, population, gdp) values ('Algeria', 'Africa', '2381741', '37100000', '188681000000')
insert into World (name, continent, area, population, gdp) values ('Andorra', 'Europe', '468', '78115', '3712000000')
insert into World (name, continent, area, population, gdp) values ('Angola', 'Africa', '1246700', '20609294', '100990000000') '''

In [ ]:
sql = ';\n'.join(sql.split('\n'))

In [ ]:
cur.executescript(sql)

In [ ]:
sql = '''select distinct t.name, t.area, t.population
from World t
where t.area > 3000000 or t.population > 25000000'''

In [ ]:
select(sql)

          name     area  population
0  Afghanistan   652230    25500100
1      Algeria  2381741    37100000

In [ ]:
sql = '''select t.sex, count(1) as cnt,
avg (t.credit_amount) as cr_am_avg from german_credit as t
group by t.sex'''

In [ ]:
select(sql)

      sex  cnt    cr_am_avg
0  female  310  2877.774194
1    male  690  3448.040580

In [ ]:
sql='''select count(distinct t.housing), count(t.housing) from german_credit t'''

In [ ]:
select(sql)

   count(distinct t.housing)  count(t.housing)
0                          3              1000

In [ ]:
sql = '''select count(t.checking_account), count(*) from german_credit t'''

In [ ]:
select(sql)

   count(t.checking_account)  count(*)
0                        606      1000

In [ ]:
sql = '''select t.checking_account, count(1) as cnt,
avg (t.credit_amount) as cr_am_avg from german_credit as t
group by t.checking_account'''

In [ ]:
select(sql)

  checking_account  cnt    cr_am_avg
0             None  394  3133.101523
1           little  274  3175.218978
2         moderate  269  3827.561338
3             rich   63  2177.650794

In [ ]:
df.groupby('checking_account', dropna=False)['credit_amount'].count()

checking_account
little      274
moderate    269
rich         63
NaN         394
Name: credit_amount, dtype: int64

In [ ]:
sql = '''select 
sum(case when t.checking_account is null then 1 else 0 end) as is_null
 from german_credit as t'''

In [ ]:
select(sql)

   is_null
0      394

In [ ]:
t = pd.DataFrame({'col1':[1, np.nan, 2], 'col2':[np.nan, np.nan, 1], 'col3':[1,2,3]})

In [ ]:
t

   col1  col2  col3
0   1.0   NaN     1
1   NaN   NaN     2
2   2.0   1.0     3

In [ ]:
t.to_sql('null_test', con, index=False, if_exists='replace')

In [ ]:
sql = '''select t.col1 from null_test as t'''

In [ ]:
select(sql)

   col1
0   1.0
1   NaN
2   2.0

In [ ]:
sql = '''select 
t.checking_account,
coalesce (t.checking_account, 'no_info') from german_credit as t'''

In [ ]:
select(sql)

    checking_account coalesce (t.checking_account, 'no_info')
0               None                                  no_info
1             little                                   little
2               None                                  no_info
3               None                                  no_info
4               None                                  no_info
..               ...                                      ...
995           little                                   little
996         moderate                                 moderate
997         moderate                                 moderate
998             None                                  no_info
999         moderate                                 moderate

[1000 rows x 2 columns]

In [ ]:
sql = '''select avg(coalesce(t.col1, 0)) from null_test as t'''

In [ ]:
select(sql)

   avg(coalesce(t.col1, 0))
0                       1.0

In [ ]:
select(sql)

   avg(coalesce(t.col1, 0))
0                       1.0

In [ ]:
sql = '''select coalesce(t.col1,t.col2, t.col3) from null_test as t'''

In [ ]:
select(sql)

   coalesce(t.col1,t.col2, t.col3)
0                              1.0
1                              2.0
2                              2.0

In [ ]:
t = pd.DataFrame({'id':[1,1,2],'name':['a','a','b']})

In [ ]:
t.to_sql('dupl_test',con,if_exists='replace', index = False)

In [ ]:
sql = '''select t.id, t.name, count(1) as cnt from dupl_test as t 
group by t.id, t.name --having count(1) > 1
'''

In [ ]:
select(sql)

   id name  cnt
0   1    a    2
1   2    b    1

In [ ]:
t = pd.DataFrame({'id':[1,1,2,2,3],
                  'name':['a','b','c','d','e']})

In [ ]:
t

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [ ]:
t.to_sql('dupl_test', con, index=False, if_exists='replace')

In [ ]:
sql='''select * from dupl_test as t'''

In [ ]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [ ]:
sql = '''select t.id as cnt from dupl_test as t 
group by t.id having count(1) > 1
'''

In [ ]:
select(sql)

   cnt
0    1
1    2

In [ ]:
sql = '''select * from dupl_test as t where t.id in (1,2)'''

In [ ]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

In [ ]:
sql = '''
select date(t.contract_dt, 'start of month') as month,
count(1) as credit_cnt,
count(distinct t.client_id) as client_id_unique,
sum(t.credit_amount) as credit_amount_sum,
avg(t.credit_amount) as credit_amount_avg
from german_credit t
group by date(t.contract_dt, 'start of month')
order by date(t.contract_dt, 'start of month')
'''

In [ ]:
select(sql)

         month  credit_cnt  ...  credit_amount_sum  credit_amount_avg
0   2007-05-01          81  ...             207663        2563.740741
1   2007-06-01          74  ...             239594        3237.756757
2   2007-07-01          71  ...             224333        3159.619718
3   2007-08-01          57  ...             178569        3132.789474
4   2007-09-01          58  ...             186909        3222.568966
5   2007-10-01          70  ...             188534        2693.342857
6   2007-11-01          87  ...             300504        3454.068966
7   2007-12-01          77  ...             273973        3558.090909
8   2008-01-01          93  ...             288080        3097.634409
9   2008-02-01          55  ...             211128        3838.690909
10  2008-03-01          63  ...             204944        3253.079365
11  2008-04-01          85  ...             305409        3593.047059
12  2008-05-01          67  ...             263043        3926.014925
13  2008-06-01          62  ...             198575        3202.822581

[14 rows x 5 columns]

In [ ]:
pd.Series(range(600)).sample(1000,replace=True)

249    249
103    103
254    254
408    408
88      88
      ...
90      90
97      97
222    222
325    325
105    105
Length: 1000, dtype: int64

In [ ]:
df['client_id_2'] = pd.Series(range(600)).sample(1000,replace=True).values

In [ ]:
df.to_sql('german_credit_not_unieque',con,index=False,if_exists='replace')

In [ ]:
sql = '''select 
date(t.contract_dt,'start of month') as month,
count(1) as credit_cnt,
count(distinct t.client_id_2) as client_id_unique,
sum(t.credit_amount) as credit_amount_sum,
avg(t.credit_amount) as credit_amount_avg

 from german_credit_not_unieque t
 group by date(t.contract_dt,'start of month')
 order by date(t.contract_dt,'start of month')
 '''

In [ ]:
select(sql)

         month  credit_cnt  ...  credit_amount_sum  credit_amount_avg
0   2007-05-01          81  ...             207663        2563.740741
1   2007-06-01          74  ...             239594        3237.756757
2   2007-07-01          71  ...             224333        3159.619718
3   2007-08-01          57  ...             178569        3132.789474
4   2007-09-01          58  ...             186909        3222.568966
5   2007-10-01          70  ...             188534        2693.342857
6   2007-11-01          87  ...             300504        3454.068966
7   2007-12-01          77  ...             273973        3558.090909
8   2008-01-01          93  ...             288080        3097.634409
9   2008-02-01          55  ...             211128        3838.690909
10  2008-03-01          63  ...             204944        3253.079365
11  2008-04-01          85  ...             305409        3593.047059
12  2008-05-01          67  ...             263043        3926.014925
13  2008-06-01          62  ...             198575        3202.822581

[14 rows x 5 columns]

In [ ]:
sql = '''select t.credit_amount,
case 
when t.credit_amount <= 1000 then '1. <= 1000'
when t.credit_amount < 2000 then '2. 1000-2000'
when t.credit_amount < 3000 then '3. 2000-3000'
when t.credit_amount >= 3000 then '4. >= 3000'
else '5. other' end as credit_amount_bin,
count(1)
from german_credit as t
group by credit_amount_bin'''

In [ ]:
select(sql)

   credit_amount credit_amount_bin  count(1)
0            936        1. <= 1000       116
1           1344      2. 1000-2000       316
2           2576      3. 2000-3000       188
3           3074        4. >= 3000       380

In [ ]:
sql = '''select t.housing, 

count(case when t.sex = 'female' then 1 else null end) as female,
count(case when t.sex = 'male' then 1 else null end) as male,

count(1) as cnt 

from german_credit t
group  by t.housing'''

In [ ]:
select(sql)

  housing  female  male  cnt
0    free      19    89  108
1     own     196   517  713
2    rent      95    84  179

In [ ]:
sql = '''select distinct t.purpose from german_credit t'''

In [ ]:
purpose = list(select(sql)['purpose'].values)

In [ ]:
purpose

['radio/TV',
 'car',
 'education',
 'furniture/equipment',
 'repairs',
 'business',
 'domestic appliances',
 'vacation/others']

In [ ]:
for p in purpose:
  print(f"count(case when t.purpose = '{p}' then 1 else null end) as {p.replace(' ','').replace('/','').lower()}")

count(case when t.purpose = 'radio/TV' then 1 else null end) as radiotv
count(case when t.purpose = 'car' then 1 else null end) as car
count(case when t.purpose = 'education' then 1 else null end) as education
count(case when t.purpose = 'furniture/equipment' then 1 else null end) as furnitureequipment
count(case when t.purpose = 'repairs' then 1 else null end) as repairs
count(case when t.purpose = 'business' then 1 else null end) as business
count(case when t.purpose = 'domestic appliances' then 1 else null end) as domesticappliances
count(case when t.purpose = 'vacation/others' then 1 else null end) as vacationothers

In [ ]:
sql = '''select t.housing, 

count(case when t.purpose = 'radio/TV' then 1 else null end) as radiotv,
count(case when t.purpose = 'car' then 1 else null end) as car,
count(case when t.purpose = 'education' then 1 else null end) as education,
count(case when t.purpose = 'furniture/equipment' then 1 else null end) as furnitureequipment,
count(case when t.purpose = 'repairs' then 1 else null end) as repairs,
count(case when t.purpose = 'business' then 1 else null end) as business,
count(case when t.purpose = 'domestic appliances' then 1 else null end) as domesticappliances,
count(case when t.purpose = 'vacation/others' then 1 else null end) as vacationothers,
count(1) as cnt 

from german_credit t
group  by t.housing'''

In [ ]:
select(sql)

  housing  radiotv  car  ...  domesticappliances  vacationothers  cnt
0    free       15   55  ...                   0               4  108
1     own      227  219  ...                  10               8  713
2    rent       38   63  ...                   2               0  179

[3 rows x 10 columns]

In [ ]:
t = pd.DataFrame({'purpose':['машина','машина','машина','на машину','на покупку машины',
                             'автомобиль','на возвращение 2007', 
                             'на свадьбу','свадьба','свадьба','свадьба','для свадьбы',
                             'недвижимость','на покупку недвижимости']})

In [ ]:
t

                    purpose
0                    машина
1                    машина
2                    машина
3                 на машину
4         на покупку машины
5                автомобиль
6       на возвращение 2007
7                на свадьбу
8                   свадьба
9                   свадьба
10                  свадьба
11              для свадьбы
12             недвижимость
13  на покупку недвижимости

In [ ]:
t.to_sql('purpose',con,index=False,if_exists='replace')

In [ ]:
cat = '''select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
when t.purpose like '%недвиж%' then 'недвижимость'

else 'другое' end as purpose_cat

 from purpose t'''

In [ ]:
select(cat)

                    purpose   purpose_cat
0                    машина        машина
1                    машина        машина
2                    машина        машина
3                 на машину        машина
4         на покупку машины        машина
5                автомобиль        машина
6       на возвращение 2007        другое
7                на свадьбу       свадьба
8                   свадьба       свадьба
9                   свадьба       свадьба
10                  свадьба       свадьба
11              для свадьбы       свадьба
12             недвижимость  недвижимость
13  на покупку недвижимости  недвижимость

In [ ]:
sql = f'''select 
t.purpose_cat,

count(1)

 from ({cat}) t
 group by t.purpose_cat'''

In [ ]:
select(sql)

    purpose_cat  count(1)
0        другое         1
1        машина         6
2  недвижимость         2
3       свадьба         5

In [ ]:
t = pd.DataFrame({'id':[1,1,2,2,3],
                  'name':['a','b','c','d','e']})

In [ ]:
t.to_sql('dupl_test',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from dupl_test t'''

In [ ]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [ ]:
sql = '''select t.id from dupl_test t
group by t.id
having count(1) > 1'''

In [ ]:
select (sql)

   id
0   1
1   2

In [ ]:
sql = '''select * from dupl_test t
where t.id in (select t.id from dupl_test t
group by t.id
having count(1) > 1)'''

In [ ]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

In [ ]:
sql = '''
drop table if exists dupls;
create table dupls as
select t.id from dupl_test t
group by t.id
having count(1) > 1'''

In [ ]:
cur.executescript(sql)

In [ ]:
sql='''select * from dupls t'''

In [ ]:
select(sql)

   id
0   1
1   2

In [ ]:
sql = '''select * from dupl_test t
where t.id in dupls'''

In [ ]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

In [ ]:
sql = '''select t.id, count(1) as cnt from dupl_test t
group by t.id'''

In [ ]:
select (sql)

   id  cnt
0   1    2
1   2    2
2   3    1

In [ ]:
sql='''
select * from 

(select t.id, count(1) as cnt from dupl_test t
group by t.id) t

where t.cnt > 1 
'''

In [ ]:
select(sql)

   id  cnt
0   1    2
1   2    2

In [ ]:
sql='''
select * from 

(select t.id, count(1) as cnt from dupl_test t
group by t.id) t

where t.cnt > 1 and t.id = 1
'''

In [ ]:
select(sql)

   id  cnt
0   1    2

In [ ]:
sql = '''
with id_cnt as (
select t.id,count(1) as cnt from dupl_test t
group by t.id),

id_cnt_2 as

(select * from id_cnt t
where t.cnt > 1)

select * from id_cnt_2 t
where t.id = 1

'''

In [ ]:
select(sql)

   id  cnt
0   1    2

In [ ]:
sql = f'''select 
t.purpose_cat,

count(1)

 from ({cat}) t
 group by t.purpose_cat'''

In [ ]:
print(sql)

select
t.purpose_cat,

count(1)

 from (select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
when t.purpose like '%недвиж%' then 'недвижимость'

else 'другое' end as purpose_cat

 from purpose t) t
 group by t.purpose_cat

In [ ]:
sql = '''
with categories as (
select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
when t.purpose like '%недвиж%' then 'недвижимость'

else 'другое' end as purpose_cat

 from purpose t)
 
 select t.purpose_cat,

count(1) from categories t
group by t.purpose_cat
'''

In [ ]:
select(sql)

    purpose_cat  count(1)
0        другое         1
1        машина         6
2  недвижимость         2
3       свадьба         5

In [ ]:
sql = '''
drop table if exists categories;
create table categories as
select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
when t.purpose like '%недвиж%' then 'недвижимость'

else 'другое' end as purpose_cat

 from purpose t'''

In [ ]:
cur.executescript(sql)

In [ ]:
sql = '''select * from categories as t'''

In [ ]:
select(sql)

                    purpose   purpose_cat
0                    машина        машина
1                    машина        машина
2                    машина        машина
3                 на машину        машина
4         на покупку машины        машина
5                автомобиль        машина
6       на возвращение 2007        другое
7                на свадьбу       свадьба
8                   свадьба       свадьба
9                   свадьба       свадьба
10                  свадьба       свадьба
11              для свадьбы       свадьба
12             недвижимость  недвижимость
13  на покупку недвижимости  недвижимость

In [ ]:
sql = '''select 
t.purpose_cat,

count(1)

 from categories t
 group by t.purpose_cat'''

In [ ]:
select(sql)

    purpose_cat  count(1)
0        другое         1
1        машина         6
2  недвижимость         2
3       свадьба         5

In [ ]:
sql = '''
with categories as (
select 1

 from purpose t)
 
 select * from categories t
'''

In [ ]:
select(sql)

    1
0   1
1   1
2   1
3   1
4   1
5   1
6   1
7   1
8   1
9   1
10  1
11  1
12  1
13  1

In [ ]:
sql = '''select * from german_credit t limit 5'''

In [ ]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [ ]:
users = pd.DataFrame({'id':[1,2,3],'name':['gleb','jon snow','tyrion']})

In [ ]:
users

   id      name
0   1      gleb
1   2  jon snow
2   3    tyrion

In [ ]:
items = pd.DataFrame({'user_id':[1,3,3],'item_name':['hleb','gold','wine'],'value':[5,100,20]})

In [ ]:
items

   user_id item_name  value
0        1      hleb      5
1        3      gold    100
2        3      wine     20

In [ ]:
users.to_sql('users',con,index=False,if_exists='replace')
items.to_sql('items',con,index=False,if_exists='replace')

In [ ]:
sql='''select * from users t
left join items as i on t.id = i.user_id
--where i.item_name is not null'''

In [ ]:
select(sql)

   id      name  user_id item_name  value
0   1      gleb      1.0      hleb    5.0
1   2  jon snow      NaN      None    NaN
2   3    tyrion      3.0      gold  100.0
3   3    tyrion      3.0      wine   20.0

In [ ]:
sql='''select * from users t
inner join items as i on t.id = i.user_id'''

In [ ]:
select(sql)

   id    name  user_id item_name  value
0   1    gleb        1      hleb      5
1   3  tyrion        3      gold    100
2   3  tyrion        3      wine     20

In [ ]:
users = pd.DataFrame({'id':[1,2,3],'name':['gleb','jon snow','tyrion'],
                      'victory':[2,10,1]})

In [ ]:
users.to_sql('users',con,index=False,if_exists='replace')

In [ ]:
sql = '''select t.*, i.item_name, i.value, i.user_id from users t
left join items i on t.id = i.user_id
'''

In [ ]:
t = select(sql)

In [ ]:
t

   id      name  victory item_name  value  user_id
0   1      gleb        2      hleb    5.0      1.0
1   2  jon snow       10      None    NaN      NaN
2   3    tyrion        1      gold  100.0      3.0
3   3    tyrion        1      wine   20.0      3.0

In [ ]:
t['victory'].sum()

14

In [ ]:
sql = '''select sum(t.victory) from users t'''

In [ ]:
select(sql)

   sum(t.victory)
0              13

In [ ]:
sql = '''select t.id, t.name, t.victory,
count(i.item_name) as item_cnt,
coalesce(sum(i.value),0) as value_sum

from users t
left join items i on t.id = i.user_id
group by t.id, t.name, t.victory
'''

In [ ]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      gleb        2         1          5
1   2  jon snow       10         0          0
2   3    tyrion        1         2        120

In [ ]:
sql = '''select t.user_id, count(t.item_name) as item_cnt,
sum(value) as value_sum from items t
group by t.user_id'''

In [ ]:
select(sql)

   user_id  item_cnt  value_sum
0        1         1          5
1        3         2        120

In [ ]:
sql = '''
with items_agg as (

select t.user_id, count(t.item_name) as item_cnt,
sum(value) as value_sum from items t
group by t.user_id)

select t.id, t.name,
t.victory,

coalesce(i.item_cnt,0) as item_cnt,
coalesce(i.value_sum,0) as value_sum

from users t

left join items_agg i on t.id = i.user_id

'''

In [ ]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      gleb        2         1          5
1   2  jon snow       10         0          0
2   3    tyrion        1         2        120

In [ ]:
sql = '''Create table If Not Exists cinema (id int, movie varchar(255), description varchar(255), rating float(2, 1))

insert into cinema (id, movie, description, rating) values ('1', 'War', 'great 3D', '8.9')
insert into cinema (id, movie, description, rating) values ('2', 'Science', 'fiction', '8.5')
insert into cinema (id, movie, description, rating) values ('3', 'irish', 'boring', '6.2')
insert into cinema (id, movie, description, rating) values ('4', 'Ice song', 'Fantacy', '8.6')
insert into cinema (id, movie, description, rating) values ('5', 'House card', 'Interesting', '9.1')'''

In [ ]:
sql = ';\n'.join(sql.split('\n'))

In [ ]:
cur.executescript(sql)

In [ ]:
sql = '''select * from cinema t
where t.id%2 = 1 and t.description !='boring'
order by t.id desc

'''

In [ ]:
select(sql)

   id       movie  description  rating
0   5  House card  Interesting     9.1
1   1         War     great 3D     8.9

In [ ]:
select(sql)

   id       movie  description  rating
0   5  House card  Interesting     9.1
1   1         War     great 3D     8.9

In [ ]:
sql = '''select * from users t
left join items2 i  on t.id=i.id
'''

In [ ]:
items = pd.DataFrame({'id':[1,3,3],'item_name':['hleb','gold','wine'],'value':[5,100,20]})

In [ ]:
items.to_sql('items2',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from users t
left join items i on t.id = i.user_id'''

In [ ]:
select(sql)

   id      name  victory  user_id item_name  value
0   1      gleb        2      1.0      hleb    5.0
1   2  jon snow       10      NaN      None    NaN
2   3    tyrion        1      3.0      gold  100.0
3   3    tyrion        1      3.0      wine   20.0

In [ ]:
sql = '''select * from users t
left join items2 i  on t.id=i.id
'''

In [ ]:
select(sql)

   id      name  victory   id item_name  value
0   1      gleb        2  1.0      hleb    5.0
1   2  jon snow       10  NaN      None    NaN
2   3    tyrion        1  3.0      gold  100.0
3   3    tyrion        1  3.0      wine   20.0

In [ ]:
sql = '''select * from 
users t, items2 i 
where t.id = i.id
'''

In [ ]:
select(sql)

   id    name  victory  id item_name  value
0   1    gleb        2   1      hleb      5
1   3  tyrion        1   3      gold    100
2   3  tyrion        1   3      wine     20

In [ ]:
users = pd.DataFrame({'id':[1,2,3],'name':['gleb','jon snow','tyrion']})

In [ ]:
users

   id      name
0   1      gleb
1   2  jon snow
2   3    tyrion

In [ ]:
items = pd.DataFrame({'user_id':[1,3,3,4],'item_name':['hleb','gold','wine','sword'],'value':[5,100,20,50]})

In [ ]:
items

   user_id item_name  value
0        1      hleb      5
1        3      gold    100
2        3      wine     20
3        4     sword     50

In [ ]:
users.to_sql('users',con,index=False,if_exists='replace')
items.to_sql('items',con,index=False,if_exists='replace')

In [ ]:
sql = '''select t.*, i.* from users t
left join items i on t.id = i.user_id'''

In [ ]:
select(sql)

   id      name  user_id item_name  value
0   1      gleb      1.0      hleb    5.0
1   2  jon snow      NaN      None    NaN
2   3    tyrion      3.0      gold  100.0
3   3    tyrion      3.0      wine   20.0

In [ ]:
sql = '''select t.*, i.* from users t
right join items i on t.id = i.user_id'''

In [ ]:
select_pg(sql)

    id    name  user_id item_name  value
0  1.0    gleb        1      hleb      5
1  3.0  tyrion        3      gold    100
2  3.0  tyrion        3      wine     20
3  NaN    None        4     sword     50

In [ ]:
import csv
from io import StringIO

def psql_insert_copy(table, conn, keys, data_iter):
    # gets a DBAPI connection that can provide a cursor
    dbapi_conn = conn.connection
    with dbapi_conn.cursor() as cur:
        s_buf = StringIO()
        writer = csv.writer(s_buf)
        writer.writerows(data_iter)
        s_buf.seek(0)

        columns = ', '.join('"{}"'.format(k) for k in keys)
        if table.schema:
            table_name = '{}.{}'.format(table.schema, table.name)
        else:
            table_name = table.name

        sql = 'COPY {} ({}) FROM STDIN WITH CSV'.format(
            table_name, columns)
        cur.copy_expert(sql=sql, file=s_buf)

In [ ]:
users.to_sql('users',con_pg,index=False,if_exists='replace',method=psql_insert_copy)
items.to_sql('items',con_pg,index=False,if_exists='replace',method=psql_insert_copy)

In [ ]:
select_pg(sql)

    id    name  user_id item_name  value
0  1.0    gleb        1      hleb      5
1  3.0  tyrion        3      gold    100
2  3.0  tyrion        3      wine     20
3  NaN    None        4     sword     50

In [ ]:
sql = '''select t.*, i.* from users t
full join items i on t.id = i.user_id'''

In [ ]:
select_pg(sql)

    id      name  user_id item_name  value
0  1.0      gleb      1.0      hleb    5.0
1  2.0  jon snow      NaN      None    NaN
2  3.0    tyrion      3.0      gold  100.0
3  3.0    tyrion      3.0      wine   20.0
4  NaN      None      4.0     sword   50.0

In [ ]:
sql = '''select t.*, i.* from users t
left join items i on t.id = i.user_id
union 
select u.*, t.* 
from items t left join users u on t.user_id = u.id
'''

In [ ]:
select(sql)

    id      name  user_id item_name  value
0  NaN      None      4.0     sword   50.0
1  1.0      gleb      1.0      hleb    5.0
2  2.0  jon snow      NaN      None    NaN
3  3.0    tyrion      3.0      gold  100.0
4  3.0    tyrion      3.0      wine   20.0

In [ ]:
sql = '''select * from german_credit t 
limit 5'''

In [ ]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [ ]:
clients = pd.DataFrame({'client_id':[200,45],'data':[1,2]})

In [ ]:
clients.to_sql('clients_task_name',con,index=False,if_exists='replace')

In [ ]:
sql = '''select t.*, ctn.data from german_credit t 
join clients_task_name ctn on t.client_id = ctn.client_id
'''

In [ ]:
select(sql)

   age     sex  job housing  ... default          contract_dt  client_id  data
0   52    male    2     own  ...       0  2008-04-27 08:23:07        200     1
1   35  female    3     own  ...       0  2007-05-06 10:58:22         45     2

[2 rows x 13 columns]

In [ ]:
sql = '''select 1 as user_id
union all
select 2 as user_id
union all
select 3 as user_id'''

In [ ]:
select(sql)

   user_id
0        1
1        2
2        3

In [ ]:
sql = '''
select date('2021-03-01') as month
union all
select date('2021-04-01') as month
'''

In [ ]:
select(sql)

        month
0  2021-03-01
1  2021-04-01

In [ ]:
sql = '''
with users as (
select 1 as user_id
union all
select 2 as user_id
union all
select 3 as user_id),

month as

(select date('2021-03-01') as month
union all
select date('2021-04-01') as month)


select * from users t
join month m on 1=1

'''

In [ ]:
select(sql)

   user_id       month
0        1  2021-03-01
1        2  2021-03-01
2        3  2021-03-01
3        1  2021-04-01
4        2  2021-04-01
5        3  2021-04-01

In [ ]:
sql = '''Create table Person (PersonId int, FirstName varchar(255), LastName varchar(255))
Create table Address (AddressId int, PersonId int, City varchar(255), State varchar(255))

insert into Person (PersonId, LastName, FirstName) values ('1', 'Wang', 'Allen')

insert into Address (AddressId, PersonId, City, State) values ('1', '2', 'New York City', 'New York')'''

In [ ]:
sql = ';\n'.join(sql.split('\n'))

In [ ]:
cur.executescript(sql)

In [ ]:
sql = '''select p.FirstName, p.LastName from person as p'''

In [ ]:
select(sql)

  FirstName LastName
0     Allen     Wang

In [ ]:
sql = '''select a.city, a.state from address as a'''

In [ ]:
select(sql)

            City     State
0  New York City  New York

FirstName, LastName, City, State

In [ ]:
sql = '''

'''

In [ ]:
select(sql)

TypeError: ignored

In [ ]:
sql = '''select * from german_credit t 
limit 5'''

In [ ]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

https://drive.google.com/file/d/1ksjv4EsLItdn9rYA4oxislish-c4eE4D/view?usp=sharing

In [ ]:
! gdown --id 1ksjv4EsLItdn9rYA4oxislish-c4eE4D

Downloading...
From: https://drive.google.com/uc?id=1ksjv4EsLItdn9rYA4oxislish-c4eE4D
To: /content/german_credit_augmented_transactions.csv
100% 134k/134k [00:00<00:00, 49.0MB/s]

In [ ]:
transactions = pd.read_csv('/content/german_credit_augmented_transactions.csv')

In [ ]:
transactions.head()

                    dt  client_id  amount
0  2008-04-06 11:54:47        950  161.38
1  2007-07-28 00:00:19        418   35.34
2  2008-03-14 20:43:54        131  146.50
3  2007-12-18 13:03:24        353  119.21
4  2007-11-09 05:18:30        849  105.24

In [ ]:
transactions.to_sql('client_transactions',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from client_transactions t limit 5'''

In [ ]:
sql = '''select 
date(t.dt, 'start of month') as month,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

 from client_transactions t
group by 1
order by 1
'''

In [ ]:
select(sql)

         month  transaction_cnt  amount_sum
0   2007-05-01              338   450912.77
1   2007-06-01              379   551664.83
2   2007-07-01              304   494134.50
3   2007-08-01              255   426903.23
4   2007-10-01              332   634846.49
5   2007-11-01              389   500420.98
6   2007-12-01              364   561449.89
7   2008-01-01              413   630137.22
8   2008-02-01              228   337043.47
9   2008-03-01              309   425599.09
10  2008-04-01              383   677194.97
11  2008-05-01              310   474962.34
12  2008-06-01              271   383710.84

In [ ]:
min = '''select date(min(t.dt),'start of month') from client_transactions t'''

In [ ]:
max = '''select date(max(t.dt),'start of month') from client_transactions t'''

In [ ]:
sql = f'''WITH RECURSIVE dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < (({max}))
)
SELECT t.month FROM dates t'''

In [ ]:
select(sql)

         month
0   2007-05-01
1   2007-06-01
2   2007-07-01
3   2007-08-01
4   2007-09-01
5   2007-10-01
6   2007-11-01
7   2007-12-01
8   2008-01-01
9   2008-02-01
10  2008-03-01
11  2008-04-01
12  2008-05-01
13  2008-06-01

In [ ]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),
trans_month as

(select 
date(t.dt, 'start of month') as month,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

 from client_transactions t
group by 1
order by 1)


SELECT t.month,
coalesce(tm.transaction_cnt,0) as transaction_cnt,
coalesce(tm.amount_sum,0) as amount_sum

FROM dates t
left join trans_month tm on t.month = tm.month
order by t.month'''

In [ ]:
select(sql)

         month  transaction_cnt  amount_sum
0   2007-05-01              338   450912.77
1   2007-06-01              379   551664.83
2   2007-07-01              304   494134.50
3   2007-08-01              255   426903.23
4   2007-09-01                0        0.00
5   2007-10-01              332   634846.49
6   2007-11-01              389   500420.98
7   2007-12-01              364   561449.89
8   2008-01-01              413   630137.22
9   2008-02-01              228   337043.47
10  2008-03-01              309   425599.09
11  2008-04-01              383   677194.97
12  2008-05-01              310   474962.34
13  2008-06-01              271   383710.84

In [ ]:
sql='''select distinct t.client_id from german_credit as t limit 5'''

In [ ]:
select(sql)

   client_id
0        210
1        929
2        200
3         45
4        358

In [ ]:
sql = '''select 
date(t.dt, 'start of month') as month,
t.client_id,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

 from client_transactions t
group by 1,2
order by 1'''

In [ ]:
select(sql)

           month  client_id  transaction_cnt  amount_sum
0     2007-05-01        101                1      149.67
1     2007-05-01        107                2      217.50
2     2007-05-01        110                1     1081.32
3     2007-05-01        111                1      139.97
4     2007-05-01        113                1     1051.29
...          ...        ...              ...         ...
3551  2008-06-01        983                1    10050.37
3552  2008-06-01        987                1      192.48
3553  2008-06-01        992                1     -610.21
3554  2008-06-01        996                1      121.28
3555  2008-06-01        999                1     -641.25

[3556 rows x 4 columns]

In [ ]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),

clients as (select distinct t.client_id from german_credit t),

clients_month as

(SELECT t.month, c.client_id FROM dates t
join clients c on 1=1),

trans_month as 

(select 
date(t.dt, 'start of month') as month,
t.client_id,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

 from client_transactions t
group by 1,2
order by 1),

client_trans_month as (

select t.*,
tm.transaction_cnt,
tm.amount_sum,
1 as user,
case when tm.transaction_cnt > 0 then 1 else 0 end as active

 from clients_month t
left join trans_month tm on t.client_id = tm.client_id
and t.month = tm.month
)

select t.month, sum(t.user) as user_cnt, sum(t.amount_sum) as amount_sum , 
sum(t.active) as active_cnt from client_trans_month t
group by t.month
'''

In [ ]:
select(sql)

         month  user_cnt  amount_sum  active_cnt
0   2007-05-01      1000   450912.77         288
1   2007-06-01      1000   551664.83         297
2   2007-07-01      1000   494134.50         259
3   2007-08-01      1000   426903.23         222
4   2007-09-01      1000         NaN           0
5   2007-10-01      1000   634846.49         283
6   2007-11-01      1000   500420.98         323
7   2007-12-01      1000   561449.89         287
8   2008-01-01      1000   630137.22         325
9   2008-02-01      1000   337043.47         204
10  2008-03-01      1000   425599.09         267
11  2008-04-01      1000   677194.97         301
12  2008-05-01      1000   474962.34         263
13  2008-06-01      1000   383710.84         237